// Copyright 2023 QMK
// SPDX-License-Identifier: GPL-2.0-or-later

#include QMK_KEYBOARD_H
#include "pointing_device.h"
#include "keymap_japanese.h"

#define BASE_CPI ((uint32_t)(128 * 125))

// カスタムキーコードを定義
enum custom_keycodes {
    ACCEL = SAFE_RANGE,  //加速モード
    SCRL_MO              // スクロールモード切替
};

// グローバル変数：加速モードかどうかを保持
static bool accel_mode = false;
static bool scroll_mode = false;

const uint16_t PROGMEM keymaps[][MATRIX_ROWS][MATRIX_COLS] = {
    /* Layer 0
     * ┌─────┬─────┬─────┬─────┬─────┬─────┐            ┌─────┬─────┬─────┬─────┬─────┬─────┐
     * │ ESC │  Q  │  W  │  E  │  R  │  T  │            │  Y  │  U  │  I  │  O  │  P  │ BS  │
     * ├─────┼─────┼─────┼─────┼─────┼─────┤            ├─────┼─────┼─────┼─────┼─────┼─────┤
     * │ SHT │  A  │  S  │  D  │  F  │  G  │            │  H  │  J  │  K  │  L  │  ;  │ SHT │
     * ├─────┼─────┼─────┼─────┼─────┼─────┼─────┐┌─────┼─────┼─────┼─────┼─────┼─────┼─────┤
     * │ CTL │  Z  │  X  │  C  │  V  │  B  │ TT3 ││ TT3 │  N  │  M  │  ,  │  .  │  /  │ CTL │
     * ├─────┼─────┼─────┼─────┼─────┼─────┼─────┤├─────┼─────┼─────┼─────┼─────┼─────┼─────┤
     * │ TAB │ TT1 │ WIN │ ALT │ EN  │ SP  │ TT2 ││ TT2 │ SP  │ KN  │ ALT │ MNU │ TT1 │ ENT │
     * └─────┴─────┴─────┴─────┼─────┼─────┼─────┘└─────┴─────┴─────┴─────┴─────┴─────┴─────┘
     *                         │     │ MO4 │
     *                         └─────┴─────┘
     */
    [0] = LAYOUT(
        KC_ESC,  JP_Q,  JP_W,    JP_E,    JP_R,    JP_T,                 JP_Y,   JP_U,    JP_I,    JP_O,   JP_P,    KC_BSPC, \
        KC_LSFT, JP_A,  JP_S,    JP_D,    JP_F,    JP_G,                 JP_H,   JP_J,    JP_K,    JP_L,   JP_SCLN, KC_RSFT, \
        KC_LCTL, JP_Z,  JP_X,    JP_C,    JP_V,    JP_B,   TT(3), TT(3), JP_N,   JP_M,    JP_COMM, JP_DOT, JP_SLSH, KC_RCTL, \
        KC_TAB,  TT(1), KC_LGUI, KC_LALT, KC_LNG2, KC_SPC, TT(2), TT(2), KC_SPC, KC_LNG1, KC_RALT, KC_APP, TT(1),   KC_ENT, \
                                          _______, MO(4) \
    ),
     /* Layer 1
     * ┌─────┬─────┬─────┬─────┬─────┬─────┐            ┌─────┬─────┬─────┬─────┬─────┬─────┐
     * │     │  1  │  2  │  3  │  4  │  5  │            │  6  │  7  │  8  │  9  │  0  │ DEL │
     * ├─────┼─────┼─────┼─────┼─────┼─────┤            ├─────┼─────┼─────┼─────┼─────┼─────┤
     * │     │     │  \  │  ^  │  -  │     │            │     │  @  │  [  │  ]  │  :  │     │
     * ├─────┼─────┼─────┼─────┼─────┼─────┼─────┐┌─────┼─────┼─────┼─────┼─────┼─────┼─────┤
     * │     │     │     │     │     │     │     ││     │     │     │     │  /  │  \  │     │
     * ├─────┼─────┼─────┼─────┼─────┼─────┼─────┤├─────┼─────┼─────┼─────┼─────┼─────┼─────┤
     * │     │     │     │     │     │     │     ││     │     │     │     │     │     │     │
     * └─────┴─────┴─────┴─────┼─────┼─────┼─────┘└─────┴─────┴─────┴─────┴─────┴─────┴─────┘
     *                         │     │     │
     *                         └─────┴─────┘
     */
   [1] = LAYOUT(
        _______, JP_1,    JP_2,    JP_3,    JP_4,    JP_5,                      JP_6,    JP_7,    JP_8,    JP_9,    JP_0,    KC_DEL,  \
        _______, _______, JP_YEN,  JP_CIRC, JP_MINS, _______,                   _______, JP_AT,   JP_LBRC, JP_RBRC, JP_COLN, _______, \
        _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, JP_SLSH, JP_BSLS, _______, \
        _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, \
                                            _______, _______ \
    ),
    /* Layer 2
     * ┌─────┬─────┬─────┬─────┬─────┬─────┐            ┌─────┬─────┬─────┬─────┬─────┬─────┐
     * │     │ F1  │ F2  │ F3  │ F4  │ F5  │            │ F6  │ F7  │ F8  │ F9  │ F10 │     │
     * ├─────┼─────┼─────┼─────┼─────┼─────┤            ├─────┼─────┼─────┼─────┼─────┼─────┤
     * │     │ F11 │ F12 │     │     │     │            │     │Home │  ↑  │ End │PgUp │     │
     * ├─────┼─────┼─────┼─────┼─────┼─────┼─────┐┌─────┼─────┼─────┼─────┼─────┼─────┼─────┤
     * │     │     │     │     │     │     │     ││     │     │  ←  │  ↓  │  →  │PgDw │     │
     * ├─────┼─────┼─────┼─────┼─────┼─────┼─────┤├─────┼─────┼─────┼─────┼─────┼─────┼─────┤
     * │     │     │     │     │     │     │     ││     │     │     │     │     │     │     │
     * └─────┴─────┴─────┴─────┼─────┼─────┼─────┘└─────┴─────┴─────┴─────┴─────┴─────┴─────┘
     *                         │     │     │
     *                         └─────┴─────┘
     */
    [2] = LAYOUT(
        _______, KC_F1,   KC_F2,   KC_F3,   KC_F4,   KC_F5,                     KC_F6,   KC_F7,   KC_F8,   KC_F9,   KC_F10,  _______, \
        _______, KC_F11,  KC_F12,  _______, _______, _______,                   _______, KC_HOME, KC_UP,   KC_END,  KC_PGUP, _______, \
        _______, _______, _______, _______, _______, _______, _______, _______, _______, KC_LEFT, KC_DOWN, KC_RGHT, KC_PGDN, _______, \
        _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, \
                                            _______, _______ \
    ),
    /* Layer 3
     * ┌─────┬─────┬─────┬─────┬─────┬─────┐            ┌─────┬─────┬─────┬─────┬─────┬─────┐
     * │     │     │     │     │     │     │            │     │     │     │     │     │     │
     * ├─────┼─────┼─────┼─────┼─────┼─────┤            ├─────┼─────┼─────┼─────┼─────┼─────┤
     * │     │     │     │     │     │     │            │     │     │     │     │     │     │
     * ├─────┼─────┼─────┼─────┼─────┼─────┼─────┐┌─────┼─────┼─────┼─────┼─────┼─────┼─────┤
     * │     │     │     │     │     │     │     ││     │     │     │     │     │     │     │
     * ├─────┼─────┼─────┼─────┼─────┼─────┼─────┤├─────┼─────┼─────┼─────┼─────┼─────┼─────┤
     * │     │     │     │     │     │     │     ││     │     │     │     │     │     │     │
     * └─────┴─────┴─────┴─────┼─────┼─────┼─────┘└─────┴─────┴─────┴─────┴─────┴─────┴─────┘
     *                         │     │     │
     *                         └─────┴─────┘
     */
    [3] = LAYOUT(
        _______, _______, _______, _______, _______, _______,                   _______, _______, _______, _______, _______, _______, \
        _______, _______, _______, _______, _______, _______,                   _______, _______, _______, _______, _______, _______, \
        _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, \
        _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, \
                                            _______, _______ \
   ),
    /* Layer 4
     * ┌─────┬─────┬─────┬─────┬─────┬─────┐            ┌─────┬─────┬─────┬─────┬─────┬─────┐
     * │     │ PLN │ BRE │ RBW │ SWI │ SNK │            │ KNT │ XMS │ GRA │ TST │ TWI │     │
     * ├─────┼─────┼─────┼─────┼─────┼─────┤            ├─────┼─────┼─────┼─────┼─────┼─────┤
     * │     │     │     │     │BLTG │BLVU │            │     │ BT1 │ BT2 │ACCEL│     │     │
     * ├─────┼─────┼─────┼─────┼─────┼─────┼─────┐┌─────┼─────┼─────┼─────┼─────┼─────┼─────┤
     * │     │     │     │BLNX │BLHU │BLSU │     ││     │     │ SCL │     │     │     │     │
     * ├─────┼─────┼─────┼─────┼─────┼─────┼─────┤├─────┼─────┼─────┼─────┼─────┼─────┼─────┤
     * │     │     │     │     │     │     │     ││     │     │     │     │     │     │     │
     * └─────┴─────┴─────┴─────┼─────┼─────┼─────┘└─────┴─────┴─────┴─────┴─────┴─────┴─────┘
     *                         │     │     │
     *                         └─────┴─────┘
     */
    [4] = LAYOUT(
        _______, RGB_M_P, RGB_M_B, RGB_M_R, RGB_M_SW, RGB_M_SN,                 RGB_M_K, RGB_M_X, RGB_M_G, RGB_M_T, RGB_M_TW, _______, \
        _______, _______, _______, _______, UG_TOGG, UG_VALU,                   _______, MS_BTN1, MS_BTN2, ACCEL,   _______, _______, \
        _______, _______, _______, UG_NEXT, UG_HUEU, UG_SATU, _______, _______, _______, SCRL_MO, _______, _______, _______, _______, \
        _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, \
                                            _______, _______ \
   )
};

// 起動時に加速モードをaz1uballに指示
// この関数はもう直接呼ばない
void init_az1uball_accel(void) {
   uint8_t addr = 0x14;  // az1uballのI2Cアドレス
    uint8_t data[] = {0x91, 0x00};  // 常時加速モード
    i2c_transmit(addr, data, 2, 100);
}

// キーボード全体の初期化後に行われる処理
void keyboard_post_init_user(void) {
    // マスター側（右側）の場合のみ実行
    if (is_keyboard_master()) {
        init_az1uball_accel(); // トラックボールの初期化をここで呼び出す

        // 明るさだけ5秒後に再送（EEPROM反映後に行うため）
        wait_ms(1000);
        rgblight_sethsv_noeeprom(
            rgblight_get_hue(),
            rgblight_get_sat(),
            rgblight_get_val()
        );
    }
    wait_ms(100); // 100ミリ秒の遅延を追加
}

// 起動時に加速モードをaz1uballに指示
//void pointing_device_init_kb(void) {
//   uint8_t addr = 0x14;  // 0x0a << 1 でも可。az1uballのI2Cアドレス
//    uint8_t data[] = {0x91, 0x00};  // 常時加速モード
//    i2c_transmit(addr, data, 2, 100);
//}

// キーイベント処理
bool process_record_user(uint16_t keycode, keyrecord_t *record) {
    //uint8_t addr = 0x14;
    //uint8_t data_n[] = {0x90, 0x00}; // ノーマルモード
    //uint8_t data_a[] = {0x91, 0x00}; // 加速モード
    //cuint16_t timeout = 100;

    switch (keycode) {
        case ACCEL:
            //常時加速モード時の加速モード
            if (record->event.pressed) {
                pimoroni_trackball_set_cpi(BASE_CPI * 4 / 2);  // 超加速（1.5倍）
                accel_mode = true;
            } else {
                pimoroni_trackball_set_cpi(BASE_CPI);  // az1uball側の加速に合わせたCPI
                accel_mode = false;
            }
//            if (record->event.pressed) {
//                // 押された：加速モードに
//                i2c_transmit(addr, data_a, 2, timeout);
//                accel_mode = true;
//            } else {
//                // 離された：ノーマルモードに戻す
//                i2c_transmit(addr, data_n, 2, timeout);
//                accel_mode = false;
//            }
            return false; // キーとしては送信しない
        case SCRL_MO:
            scroll_mode = record->event.pressed;  //モーメンタリ
            //トグルの場合
            //if (record->event.pressed) {
            //    scroll_mode = !scroll_mode;
            //}
            return false;
    }
    return true;
}

// ポインティングデバイスの動作切替
report_mouse_t pointing_device_task_user(report_mouse_t mouse_report) {
    if (scroll_mode) {
        report_mouse_t scroll_report = {0};
        scroll_report.h =  mouse_report.x;
        scroll_report.v = -mouse_report.y;
        return scroll_report;
    }
    return mouse_report;
}